Table of Contents
 Enum CrossSectionType
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Type of cross-section
public enum CrossSectionType
Fields
BeamShapeBox = 79
Beam cross-section - Box
BeamShapeBox1 = 80
Beam cross-section - Box - 1
BeamShapeIHaunchChamfer = 76
Beam cross-section - I haunch chamfer
BeamShapeIHaunchChamferAssym = 77
Beam cross-section - I haunch chamfer assymetric
BeamShapeIZDegen = 88
Beam cross-section - IZ Degen
BeamShapeIrevDegen = 83
Beam cross-section - I rev Degen
BeamShapeIrevDegenAdd = 84
Beam cross-section - I rev Degen Add
BeamShapeLDegen = 89
Beam cross-section - L Degen
BeamShapeRevU = 78
Beam cross-section - Rev U
BeamShapeTrevChamferHaunchD = 82
Beam cross-section - T rev Chamfer Haunch D
BeamShapeTrevChamferHaunchS = 81
Beam cross-section - T rev Chamfer Haunch S
BeamShapeTrevDegen = 85
Beam cross-section - T rev Degen
BeamShapeTrevDegenAdd = 86
Beam cross-section - T rev Degen Add
BeamShapeZDegen = 87
Beam cross-section - Z Degen
Box2I = 18
Box from double I rolled - II
Box2L = 21
Box welded from two rolled L-profiles
Box2U = 19
Box from double 2U
Box2U2PI = 20
Box from 2U and 2 Plates
Box4L = 22
Box section welded from 4 L-profiles
BoxDelta = 98
Welded box - delta shape
BoxFl = 16
Welded Box - contains two dominante flanges and two webs
BoxTriangle = 99
Welded box - triangular shape
BoxWeb = 17
Welded Box - contains two dominante flanges and two webs, bottom flange is inside between webs
CF2Co = 100
Cold formed - Pair 2C - opened (back to back)
CF2Cpo = 105
Cold formed - Pair 2C+ - opened (back to back)
CFC = 93
Cold formed thin-wall C section
CFCp = 104
Cold formed thin-wall C+ section
CFGeneral = 103
Cold formed - general shape
CFL = 95
Cold formed thin-wall angle section
CFLgen = 102
Cold formed - general angle section
CFOmega = 97
Cold formed thin-wall omega section
CFRegPolygon = 96
Cold formed thin-wall regular polygon
CFRhs = 106
Cold formed - rectangular hollow section
CFSigma = 92
Cold formed thin-wall sigma section
CFU = 94
Cold formed thin-wall Channel section
CFZ = 90
Cold formed thin-wall Z section
CFZed = 91
Cold formed thin-wall Z section with lips
CHSPar = 101
Parametric circular hollow section
CHSg = 34
Massive circular hollow section
CompositeBeamBox = 53
Hollow cross-section with composite slab
CompositeBeamBox1 = 54
Hollow cross-section with composite slab
CompositeBeamIgenT = 55
I-shaped cross-section with composite slab
CompositeBeamLLeft = 56
Composite beam cross-section - L left
CompositeBeamPlate = 57
Composite slab
CompositeBeamRResT = 58
Composite beam cross-section - R res T
CompositeBeamRResT1 = 59
Composite beam cross-section - R res T - 1
CompositeBeamRT = 60
Composite beam cross-section - R T
CompositeBeamShapeChamf = 61
I-shaped cross-section with composite slab
CompositeBeamShapeChamfAssym = 62
Assymetrical I-shaped cross-section with composite slab
CompositeBeamShapeIT = 64
I-shaped cross-section with composite slab
CompositeBeamShapeITAssym = 65
Assymetrical I-shaped cross-section with composite slab
CompositeBeamShapeIgen = 63
I-shaped cross-section with composite slab
CompositeBeamShapeTT = 75
Composite beam cross-section - TT
CompositeBeamTLeft = 66
Composite beam cross-section - T left
CompositeBeamTrapezoid = 67
Trapezoidal cross-section with composite slab
CompositeBeamTresT = 68
T-shaped cross-section with composite slab
CompositeBeamTrev = 69
T-shaped cross-section with composite slab
CompositeBeamTrevResI = 70
Composite beam cross-section - T rev res I
CompositeBeamTrevResI1 = 71
Composite beam cross-section - T rev res I - 1
CompositeBeamTrevResR = 72
Composite beam cross-section - T rev res R
CompositeBeamTrevResR1 = 73
Composite beam cross-section - T rev res R - 1
CompositeBeamTrevT = 74
Composite beam cross-section - T rev T
General = 38
General cross-section
GeneralConcrete = 52
General concrete cross-section
GeneralSteel = 51
General steel cross-section
Igh = 29
Massive symetrical I with web root chamfering
Ign = 28
Massive asymetrical I
Iw = 23
Welded I
Iwn = 24
Asymmetrical welded I
Lg = 31
Massive L
LgMirrored = 32
Mirrored Massive L
O = 26
Circular section
OneComponentCss = 0
Cross-section with one component without shape specification
Oval = 37
Oval shape
RHSg = 36
Massive Rectangular hollow section
Rect = 27
Rectangular
Rolled2I = 39
Pair rolled 2I
RolledAngle = 2
Rolled angle
RolledCHS = 5
Rolled circular holow section
RolledDoubleLt = 10
Composed double L rolled -
RolledDoubleLu = 11
Pair double L |_ _
RolledDoubleUc = 8
Composed double U rolled - []
RolledDoubleUo = 7
Composed double U rolled - ][
RolledI = 1
Rolled I
RolledIPar = 13
Rolled IPar - Parametrized I section
RolledLPar = 15
Rolled LPar - Parametrized Angle section
RolledRHS = 6
Rolled rectangular hollow setion
RolledT = 3
Rolled T
RolledTI = 12
T profile made from part of I profile
RolledU = 4
Rolled Channel
RolledUPar = 14
Rolled UPar - Parametrized Channel section
Sg = 50
Massive S section
TT = 48
TT section
TT1 = 49
TT chamfer section
Tchamfer1 = 46
Massive T chamfer 1
Tchamfer2 = 47
Massive T chamfer 2
Tg = 30
Massive T
Tgrev = 43
Massive T reverse
Trapezoid = 40
Trapezoid
Ttfh = 41
Massive T with top flange haunch
Ttfhrev = 44
Massive T reverse with bottom flange haunch
Tw = 25
Welded T
Twh = 42
Massive T with wall haunch
Twhrev = 45
Massive T reverse with wall haunch
Ug = 33
Massive U
UniqueName = 1001
Unique Name
Zg = 35
Massive Z section
Fields
 Name |  Description
 BeamShapeBox = 79
Beam cross-section - Box
 BeamShapeBox1 = 80
Beam cross-section - Box - 1
 BeamShapeIHaunchChamfer = 76
Beam cross-section - I haunch chamfer
 BeamShapeIHaunchChamferAssym = 77
Beam cross-section - I haunch chamfer assymetric
 BeamShapeIZDegen = 88
Beam cross-section - IZ Degen
 BeamShapeIrevDegen = 83
Beam cross-section - I rev Degen
 BeamShapeIrevDegenAdd = 84
Beam cross-section - I rev Degen Add
 BeamShapeLDegen = 89
Beam cross-section - L Degen
 BeamShapeRevU = 78
Beam cross-section - Rev U
 BeamShapeTrevChamferHaunchD = 82
Beam cross-section - T rev Chamfer Haunch D
 BeamShapeTrevChamferHaunchS = 81
Beam cross-section - T rev Chamfer Haunch S
 BeamShapeTrevDegen = 85
Beam cross-section - T rev Degen
 BeamShapeTrevDegenAdd = 86
Beam cross-section - T rev Degen Add
 BeamShapeZDegen = 87
Beam cross-section - Z Degen
 Box2I = 18
Box from double I rolled - II
 Box2L = 21
Box welded from two rolled L-profiles
 Box2U = 19
Box from double 2U
 Box2U2PI = 20
Box from 2U and 2 Plates
 Box4L = 22
Box section welded from 4 L-profiles
 BoxDelta = 98
Welded box - delta shape
 BoxFl = 16
Welded Box - contains two dominante flanges and two webs
 BoxTriangle = 99
Welded box - triangular shape
 BoxWeb = 17
Welded Box - contains two dominante flanges and two webs, bottom flange is inside between webs
 CF2Co = 100
Cold formed - Pair 2C - opened (back to back)
 CF2Cpo = 105
Cold formed - Pair 2C+ - opened (back to back)
 CFC = 93
Cold formed thin-wall C section
 CFCp = 104
Cold formed thin-wall C+ section
 CFGeneral = 103
Cold formed - general shape
 CFL = 95
Cold formed thin-wall angle section
 CFLgen = 102
Cold formed - general angle section
 CFOmega = 97
Cold formed thin-wall omega section
 CFRegPolygon = 96
Cold formed thin-wall regular polygon
 CFRhs = 106
Cold formed - rectangular hollow section
 CFSigma = 92
Cold formed thin-wall sigma section
 CFU = 94
Cold formed thin-wall Channel section
 CFZ = 90
Cold formed thin-wall Z section
 CFZed = 91
Cold formed thin-wall Z section with lips
 CHSPar = 101
Parametric circular hollow section
 CHSg = 34
Massive circular hollow section
 CompositeBeamBox = 53
Hollow cross-section with composite slab
 CompositeBeamBox1 = 54
Hollow cross-section with composite slab
 CompositeBeamIgenT = 55
I-shaped cross-section with composite slab
 CompositeBeamLLeft = 56
Composite beam cross-section - L left
 CompositeBeamPlate = 57
Composite slab
 CompositeBeamRResT = 58
Composite beam cross-section - R res T
 CompositeBeamRResT1 = 59
Composite beam cross-section - R res T - 1
 CompositeBeamRT = 60
Composite beam cross-section - R T
 CompositeBeamShapeChamf = 61
I-shaped cross-section with composite slab
 CompositeBeamShapeChamfAssym = 62
Assymetrical I-shaped cross-section with composite slab
 CompositeBeamShapeIT = 64
I-shaped cross-section with composite slab
 CompositeBeamShapeITAssym = 65
Assymetrical I-shaped cross-section with composite slab
 CompositeBeamShapeIgen = 63
I-shaped cross-section with composite slab
 CompositeBeamShapeTT = 75
Composite beam cross-section - TT
 CompositeBeamTLeft = 66
Composite beam cross-section - T left
 CompositeBeamTrapezoid = 67
Trapezoidal cross-section with composite slab
 CompositeBeamTresT = 68
T-shaped cross-section with composite slab
 CompositeBeamTrev = 69
T-shaped cross-section with composite slab
 CompositeBeamTrevResI = 70
Composite beam cross-section - T rev res I
 CompositeBeamTrevResI1 = 71
Composite beam cross-section - T rev res I - 1
 CompositeBeamTrevResR = 72
Composite beam cross-section - T rev res R
 CompositeBeamTrevResR1 = 73
Composite beam cross-section - T rev res R - 1
 CompositeBeamTrevT = 74
Composite beam cross-section - T rev T
 General = 38
General cross-section
 GeneralConcrete = 52
General concrete cross-section
 GeneralSteel = 51
General steel cross-section
 Igh = 29
Massive symetrical I with web root chamfering
 Ign = 28
Massive asymetrical I
 Iw = 23
Welded I
 Iwn = 24
Asymmetrical welded I
 Lg = 31
Massive L
 LgMirrored = 32
Mirrored Massive L
 O = 26
Circular section
 OneComponentCss = 0
Cross-section with one component without shape specification
 Oval = 37
Oval shape
 RHSg = 36
Massive Rectangular hollow section
 Rect = 27
Rectangular
 Rolled2I = 39
Pair rolled 2I
 RolledAngle = 2
Rolled angle
 RolledCHS = 5
Rolled circular holow section
 RolledDoubleLt = 10
Composed double L rolled -
 RolledDoubleLu = 11
Pair double L |_ _
 RolledDoubleUc = 8
Composed double U rolled - []
 RolledDoubleUo = 7
Composed double U rolled - ][
 RolledI = 1
Rolled I
 RolledIPar = 13
Rolled IPar - Parametrized I section
 RolledLPar = 15
Rolled LPar - Parametrized Angle section
 RolledRHS = 6
Rolled rectangular hollow setion
 RolledT = 3
Rolled T
 RolledTI = 12
T profile made from part of I profile
 RolledU = 4
Rolled Channel
 RolledUPar = 14
Rolled UPar - Parametrized Channel section
 Sg = 50
Massive S section
 TT = 48
TT section
 TT1 = 49
TT chamfer section
 Tchamfer1 = 46
Massive T chamfer 1
 Tchamfer2 = 47
Massive T chamfer 2
 Tg = 30
Massive T
 Tgrev = 43
Massive T reverse
 Trapezoid = 40
Trapezoid
 Ttfh = 41
Massive T with top flange haunch
 Ttfhrev = 44
Massive T reverse with bottom flange haunch
 Tw = 25
Welded T
 Twh = 42
Massive T with wall haunch
 Twhrev = 45
Massive T reverse with wall haunch
 Ug = 33
Massive U
 UniqueName = 1001
Unique Name
 Zg = 35
Massive Z section
 Edit this page